{"loss": "mse", "optimizer": {"nesterov": true, "lr": 0.009999999776482582, "name": "SGD", "momentum": 0.8999999761581421, "decay": 0.0}, "class_name": "Sequential", "keras_version": "1.0.5", "config": [{"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_7", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 10, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 1, 32, 32], "W_regularizer": null, "activation": "relu", "nb_row": 10}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_8", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 6, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 6}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_9", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 5}}], "sample_weight_mode": null}